#+STARTUP: fold
* 1
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=n;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1 2 3 4 5
: 1 2 3 4 5
: 1 2 3 4 5
: 1 2 3 4 5
: 1 2 3 4 5
* 2
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=n;j++){
        printf("%d ",i);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1 1 1 1 1
: 2 2 2 2 2
: 3 3 3 3 3
: 4 4 4 4 4
: 5 5 5 5 5
* 3
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=n;j++){
        printf("%d ",(n+1)-j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 5 4 3 2 1
: 5 4 3 2 1
: 5 4 3 2 1
: 5 4 3 2 1
: 5 4 3 2 1

#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=n;j>=1;j--){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 5 4 3 2 1
: 5 4 3 2 1
: 5 4 3 2 1
: 5 4 3 2 1
: 5 4 3 2 1

* 4
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1
: 1 2
: 1 2 3
: 1 2 3 4
: 1 2 3 4 5
* 5
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        printf("%d ",i);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1
: 2 2
: 3 3 3
: 4 4 4 4
: 5 5 5 5 5
* 6
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        printf("%d ",(n+1)-j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 5
: 5 4
: 5 4 3
: 5 4 3 2
: 5 4 3 2 1

#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=n;i>=1;i--){
    for(int j=n;j>=i;j--){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 5
: 5 4
: 5 4 3
: 5 4 3 2
: 5 4 3 2 1

* 7
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        printf("%d ",(i+1)-j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1
: 2 1
: 3 2 1
: 4 3 2 1
: 5 4 3 2 1

#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=i;j>=1;j--){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1
: 2 1
: 3 2 1
: 4 3 2 1
: 5 4 3 2 1
* 8
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=(n+1)-i;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1 2 3 4 5
: 1 2 3 4
: 1 2 3
: 1 2
: 1

#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=n;i>=1;i--){
    for(int j=1;j<=i;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1 2 3 4 5
: 1 2 3 4
: 1 2 3
: 1 2
: 1
* 9
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=(n+1)-i;j++){
        printf("%d ",j+i-1);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1 2 3 4 5
: 2 3 4 5
: 3 4 5
: 4 5
: 5

#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=i;j<=n;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1 2 3 4 5
: 2 3 4 5
: 3 4 5
: 4 5
: 5
* 10
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=(n+1)-i;j++){
        printf("%d ",(n+1)-j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 5 4 3 2 1
: 5 4 3 2
: 5 4 3
: 5 4
: 5
* 11
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=(n+1)-i;j++){
        printf("%d ",(n+2)-(j+i));
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 5 4 3 2 1
: 4 3 2 1
: 3 2 1
: 2 1
: 1
* 12
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        if(j==1||i==5||i==j)
        printf("* ");
        else printf(" ");
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: *
: * *
: *  *
: *   *
: * * * * *
* 13
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5,k=1;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        printf("%d ",k++);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1
: 2 3
: 4 5 6
: 7 8 9 10
: 11 12 13 14 15

* 14
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
  for(int l=1;l<=n-i;l++)
  printf(" ");
    for(int j=1;j<=i;j++){
      printf("%d",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
:     1
:    12
:   123
:  1234
: 12345
* 15
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  for(int i=1;i<=n;i++){
    for(int j=1;j<=(n+1)-i;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
#+begin_example
1
1 2
1 2 3
1 2 3 4
1 2 3 4 5
1 2 3 4 5
1 2 3 4
1 2 3
1 2
1
#+end_example

* 16
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  for(int i=1;i<=n-1;i++){
    for(int j=1;j<=n-i;j++){
        printf("%d ",j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1
: 1 2
: 1 2 3
: 1 2 3 4
: 1 2 3 4 5
: 1 2 3 4
: 1 2 3
: 1 2
: 1

* 17
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=i;j++){
        printf("%d",j);
    if(i!=j) printf("*");
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1
: 1*2
: 1*2*3
: 1*2*3*4
: 1*2*3*4*5

* 18
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
    for(int j=1;j<=(n+1)-i;j++){
        printf("%d",j);
        if((n+1)-i!=j) printf("*");
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1*2*3*4*5
: 1*2*3*4
: 1*2*3
: 1*2
: 1

#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=n;i>=1;i--){
    for(int j=1;j<=i;j++){
        printf("%d",j);
        if(i!=j) printf("*");
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1*2*3*4*5
: 1*2*3*4
: 1*2*3
: 1*2
: 1
* 19
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
  for(int l=1;l<=n-i;l++)
  printf(" ");
    for(int j=1;j<=i;j++){
      printf("%d",j);
    }for(int j=1;j<=i;j++){
        printf("%d",(i+1)-j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
:     11
:    1221
:   123321
:  12344321
: 1234554321
* 20
#+begin_src C++ :results output
#include<stdio.h>
int main(){
  int n=5;
  for(int i=1;i<=n;i++){
  for(int l=1;l<=n-i;l++)
  printf(" ");
    for(int j=1;j<=i;j++){
      printf("%d",j);
    }for(int j=1;j<=i;j++){
        if(i-j!=0)printf("%d",i-j);
    }
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
:     1
:    121
:   12321
:  1234321
: 123454321
* 21
